УТ_для_edt.РасширениеСмарт/src/Documents/СборкаТоваров/СборкаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СборкаТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ВнутренняяПередачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="51ad2381-0d1f-4a17-823e-32dfa2be2232">
    <name>ВозвратДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтДругойОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПодотчетника</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратНедопоставленногоТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратНеперечисленнойЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратНеперечисленныхДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратОтКомиссионера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратОтРозничногоПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b9173f63-0738-4171-948a-e90e1e33ba23">
    <name>ВозвратОтХранителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5407710e-c387-4626-8b05-5211234aa07e">
    <name>ВозвратТоваровКомитенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="34640f68-5c62-4ba4-9701-91967a54a881">
    <name>ВозвратТоваровПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ce981ba1-51f7-44d0-99db-29d24af3a802">
    <name>ВыдачаДенежныхСредствВДругуюКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c7a92b86-d4b7-444e-b574-99f2caed6111">
    <name>ВыдачаДенежныхСредствВКассуККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="95818758-8542-4405-8773-6b644d757e22">
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6915db6f-cc8d-4766-aca9-84cf48edcd58">
    <name>ВыдачаЗаймаСотруднику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b5771beb-5568-450d-963a-bfe9090b7f8c">
    <name>ВыдачаЗаймов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6d079ef6-b405-487d-9ff8-d6cbe795713f">
    <name>ВыплатаЗарплатыНаЛицевыеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b4199927-65e9-4e54-90f9-456e4c68a93f">
    <name>ВыплатаЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="883d636d-f604-43b6-9d3c-4aa11be20085">
    <name>ВыплатаЗарплатыРаботнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="987c15be-84c5-4923-a839-5533e7ab4c5c">
    <name>ВыплатаЗарплатыРаздатчиком</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="240b34c3-b18a-47c5-9f2f-bd241e23e42a">
    <name>ВыплатаЗарплатыЧерезКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаВСтранахЕАЭС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаВСтранахЕАЭСТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаВСтранахЕАЭСФактуровкаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаПоИмпорту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаПоИмпортуТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщикаРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщикаТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщикаФактуровкаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаЧерезПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5378e85b-b5ef-4819-816d-7cff3ed3291f">
    <name>ИнкассацияДенежныхСредствВБанк</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИнкассацияДенежныхСредствИзБанка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИсправлениеОшибок</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КонвертацияВалюты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КорректировкаПоСогласованиюСторон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="692215c8-f484-4e22-b24f-430cd2009fae">
    <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="15ce947b-5b8c-4087-b372-2f3f60dedd76">
    <name>ОплатаЛизингодателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2d869152-e27f-4d56-a690-de6ac662ace2">
    <name>ОплатаПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1923f574-7981-46df-b96d-b293c2f88d8c">
    <name>ОплатаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОформлениеГТДБрокером</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОформлениеГТДСамостоятельно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="af539695-7bf1-4480-85fa-d029bcbfda95">
    <name>ПередачаНаХранениеСПравомПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваровМеждуФилиалами</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПереоценкаРасчетовСКлиентами</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1e18177a-fe02-4999-a369-fb008fe9fd42">
    <name>ПеречислениеВБюджет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаДругойСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="572c15b7-b781-43a9-91fb-eecc7ecffee8">
    <name>ПеречислениеНаДепозиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1879ad4f-47e1-438b-9738-f1429bc3c780">
    <name>ПеречислениеТаможне</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПогашениеЗаймаСотрудником</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзБанка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойКассы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассыККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассыНаРасчетныйСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствПоДепозитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствПоЗаймамВыданным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСДругогоСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыПоПлатежнойКарте</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПриемНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПриемНаХранениеСПравомПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="693adf02-fccb-4cd9-a092-f9fa532b7983">
    <name>ПрочаяВыдачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ad2322ce-9ed5-4e79-ace7-6f03b97d9445">
    <name>РазборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиентуРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияПерепоставленногоТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f675a52b-940a-480e-8374-c64ff49e4478">
    <name>СборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8ed431c8-e520-4853-99da-e30f78c67d3c">
    <name>СдачаДенежныхСредствВБанк</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ae5b97e9-6e3e-40da-af52-695ba210a200">
    <name>СписаниеДебиторскойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="733cca42-63ac-4b08-87d9-90abec9c03ec">
    <name>СписаниеКредиторскойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82e6dbf8-d7ba-4382-9880-9e83d175a158">
    <name>СписаниеТоваровПоТребованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Назначения/Назначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Назначения</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ДвиженияПоСкладскимРегистрам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипНазначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтролироватьТолькоНаличие</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Documents/СборкаТоваров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеренесеноСДоработками

//++ #1646 смарт: Мосолов 20.02.2024 // Контроль разобранного оборудования и снятых запчастей  
&ИзменениеИКонтроль("ИнициализироватьДанныеДокумента")
Процедура смарт_ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры)

	// Создание запроса инициализации движений и заполенение его параметров.
	Запрос = Новый Запрос;
	Реквизиты = ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);

	// Формирование текста запроса.
	ТекстыЗапроса = Новый СписокЗначений;

	ТекстЗапросаТаблицаЗаказыНаСборку(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаСвободныеОстатки(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаТоварыКОтгрузке(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаТоварыКПоступлению(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаТоварыНаСкладах(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаДвижениеТоваров(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаДатыПоступленияТоваровОрганизаций(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаТоварыОрганизаций(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаТоварыОрганизацийКПередаче(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаТоварыКОформлениюОтчетовКомитенту(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаПартииТоваровОрганизаций(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаОбеспечениеЗаказов(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаСебестоимостьТоваров(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаДвиженияНоменклатураНоменклатура(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры); 
	
	#Вставка 
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
	смартТекстЗапросаТаблицаЗаявкиНаРазборкуОборудования(Запрос, ТекстыЗапроса, Регистры);
	смартТекстЗапросаТаблицаОборудованиеКРазборке(Запрос, ТекстыЗапроса, Регистры);
	//-- #1901 смарт: Ермаков 21.08.2024
	#КонецВставки

	// Исполнение запроса и выгрузка полученных таблиц для движений.
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);

КонецПроцедуры

//++ #1646 смарт: Мосолов 20.02.2024 // Контроль разобранного оборудования и снятых запчастей  
&ИзменениеИКонтроль("ЗаполнитьПараметрыИнициализации")
Функция смарт_ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)

	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеШапки.Дата                         КАК Период,
	|	ДанныеШапки.Номер                        КАК Номер,
	|	ДанныеШапки.Ссылка                       КАК Ссылка,
	|	ДанныеШапки.Организация                  КАК Организация,
	|	ДанныеШапки.Подразделение                КАК Подразделение,
	|	ЕСТЬNULL(ДанныеШапки.Подразделение.ВариантОбособленногоУчетаТоваров, ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПустаяСсылка))КАК ВариантОбособленногоУчетаТоваров,
	|	ДанныеШапки.Сделка                       КАК Сделка,
	|	ЕСТЬNULL(ДанныеШапки.Сделка.ОбособленныйУчетТоваровПоСделке, ЛОЖЬ) КАК ОбособленныйУчетТоваровПоСделке,
	|	ДанныеШапки.ЗаказНаСборку                КАК ЗаказНаСборку,
	|	ДанныеШапки.ДатаРаспоряжения             КАК ДатаРаспоряжения,
	|	ДанныеШапки.Склад                        КАК Склад,
	|	ДанныеШапки.Номенклатура                 КАК Номенклатура,
	|	ДанныеШапки.Характеристика               КАК Характеристика,
	|	ДанныеШапки.Назначение                   КАК Назначение,
	|	ДанныеШапки.Серия                        КАК Серия,
	|	ДанныеШапки.Статус                       КАК Статус,
	|	ДанныеШапки.СборкаПодДеятельность        КАК СборкаПодДеятельность,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
	|				И ДанныеШапки.Дата >= ДанныеШапки.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                                      КАК ОрдернаяСхемаПриОтгрузке,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|				И ДанныеШапки.Дата >= ДанныеШапки.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                                      КАК ОрдернаяСхемаПриПоступлении,
	|	ДанныеШапки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	(ВЫБОР ДанныеШапки.НоменклатураОсновногоКомпонента
	|		КОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяССылка) ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ) КАК УказанОсновнойКомпонент,
	|	ДанныеШапки.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеШапки.Ответственный          КАК Ответственный,
	|	ДанныеШапки.Комментарий            КАК Комментарий,
	|	ДанныеШапки.ПометкаУдаления        КАК ПометкаУдаления,
	|	ДанныеШапки.Проведен               КАК Проведен,
	|	ДанныеШапки.ВариантПриемкиТоваров  КАК ВариантПриемкиТоваров
	|ИЗ
	|	Документ.СборкаТоваров КАК ДанныеШапки
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";

	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();

	НакладнаяЯвляетсяРаспоряжением = ЗакупкиСервер.РаспоряжениеНаПриемкуТовараНакладная(Реквизиты.ВариантПриемкиТоваров);

	Запрос.УстановитьПараметр("Склад",                            Реквизиты.Склад);
	Запрос.УстановитьПараметр("Период",                           Реквизиты.Период);
	Запрос.УстановитьПараметр("Статус",                           Реквизиты.Статус);
	Запрос.УстановитьПараметр("ДатаРаспоряжения",                 Реквизиты.ДатаРаспоряжения);
	Запрос.УстановитьПараметр("Серия",                            Реквизиты.Серия);
	Запрос.УстановитьПараметр("Организация",                      Реквизиты.Организация);
	Запрос.УстановитьПараметр("Подразделение",                    Реквизиты.Подразделение);
	Запрос.УстановитьПараметр("ЗаказНаСборку",                    Реквизиты.ЗаказНаСборку);
	Запрос.УстановитьПараметр("СборкаПоЗаказу",                   ЗначениеЗаполнено(Реквизиты.ЗаказНаСборку));
	Запрос.УстановитьПараметр("ХозяйственнаяОперация",            Реквизиты.ХозяйственнаяОперация);
	Запрос.УстановитьПараметр("ОрдернаяСхемаПриОтгрузке",         Реквизиты.ОрдернаяСхемаПриОтгрузке);
	Запрос.УстановитьПараметр("ОрдернаяСхемаПриПоступлении",      Реквизиты.ОрдернаяСхемаПриПоступлении);
	Запрос.УстановитьПараметр("СборкаПодДеятельность",            Реквизиты.СборкаПодДеятельность);
	Запрос.УстановитьПараметр("УказанОсновнойКомпонент",          Реквизиты.УказанОсновнойКомпонент);
	Запрос.УстановитьПараметр("УказанОсновнойКомпонент",          Реквизиты.УказанОсновнойКомпонент);
	Запрос.УстановитьПараметр("ФормироватьВидыЗапасовПоГруппамФинансовогоУчета", ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоГруппамФинансовогоУчета"));

	Запрос.УстановитьПараметр("Назначение",                       Реквизиты.Назначение);
	Запрос.УстановитьПараметр("Номенклатура",                     Реквизиты.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",                   Реквизиты.Характеристика);
	Запрос.УстановитьПараметр("НаправлениеДеятельности",          Реквизиты.НаправлениеДеятельности);
	Запрос.УстановитьПараметр("НакладнаяЯвляетсяРаспоряжением",   НакладнаяЯвляетсяРаспоряжением);

	Запрос.УстановитьПараметр("Номер",                            Реквизиты.Номер);
	Запрос.УстановитьПараметр("НомерНаПечать",                    ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер));
	Запрос.УстановитьПараметр("Ответственный",                    Реквизиты.Ответственный);
	Запрос.УстановитьПараметр("ИдентификаторМетаданных",          ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.СборкаТоваров"));
	Запрос.УстановитьПараметр("Комментарий",                      Реквизиты.Комментарий);
	Запрос.УстановитьПараметр("ПометкаУдаления",                  Реквизиты.ПометкаУдаления);
	Запрос.УстановитьПараметр("Проведен",                         Реквизиты.Проведен);
	Запрос.УстановитьПараметр("Сделка",                           Реквизиты.Сделка);
	Запрос.УстановитьПараметр("ОбособленныйУчетТоваровПоСделке",  Реквизиты.ОбособленныйУчетТоваровПоСделке);
	Запрос.УстановитьПараметр("ВариантОбособленногоУчетаТоваров", Реквизиты.ВариантОбособленногоУчетаТоваров);
	
	#Вставка 
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
	смартСборкаРазборкаОборудованияСервер.ДополнитьПараметрыИнициализацииПроведения(ДокументСсылка, Запрос);
	//-- #1901 смарт: Ермаков 21.08.2024
	#КонецВставки

	РасчетСебестоимостиПрикладныеАлгоритмы.ЗаполнитьПараметрыИнициализации(Запрос, Реквизиты);

	Возврат Реквизиты;

КонецФункции

&ИзменениеИКонтроль("ТекстЗапросаТаблицаЗаказыНаСборку")
Функция смарт_ТекстЗапросаТаблицаЗаказыНаСборку(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "ЗаказыНаСборку";

	Если Не ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ТекстЗапроса =
	// Комплекты, отгружаемые серии заданы в шапке.
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&ДатаРаспоряжения                      КАК Период,
	|	ТаблицаТовары.ЗаказНаСборку            КАК ЗаказНаСборку,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	#Удаление
	|	ВЫБОР КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров) ТОГДА
	|				ТаблицаТовары.Серия
	|		КОНЕЦ                              КАК Серия,
	#КонецУдаления
	#Вставка
	//++ #Б2138 смарт: Шляпников 19.02.2025 / Заявка на разборку оборудования. Обратная сборка оборудования.
	|	ВЫБОР КОГДА ТаблицаТовары.ЗаказНаСборку.ДокументОснование ССЫЛКА Документ.смартЗаявкаНаРазборкуОборудования
	|				И НЕ ТаблицаТовары.ЗаказНаСборку.ДокументОснование = ЗНАЧЕНИЕ(Документ.смартЗаявкаНаРазборкуОборудования.ПустаяСсылка) ТОГДА
	|		ТаблицаТовары.Серия
	|	КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров) ТОГДА
	|		ТаблицаТовары.Серия
	|	КОНЕЦ                              КАК Серия,
	//-- #Б2138 смарт: Шляпников 19.02.2025
	#КонецВставки
	|	1                                      КАК КодСтроки,
	|	ВЫБОР КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров) ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияЗапасов.Поступление)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияЗапасов.Отгрузка)
	|		КОНЕЦ                              КАК ТипСборки,
	|	ТаблицаТовары.Количество               КАК Заказано,
	|	ТаблицаТовары.Количество               КАК КОформлению
	|ИЗ
	|	Документ.СборкаТоваров КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &СборкаПоЗаказу
	// В том числе статус = 14, тогда серии берутся из шапки.
	|	И (ТаблицаТовары.СтатусУказанияСерий <> 10
	|		ИЛИ &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)) 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Комплекты, отгружаемые серии заданы в отдельной табличной части.
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)              КАК ВидДвижения,
	|	&ДатаРаспоряжения                                   КАК Период,
	|	&ЗаказНаСборку                                      КАК ЗаказНаСборку,
	|	ТаблицаТовары.Номенклатура                          КАК Номенклатура,
	|	ТаблицаТовары.Характеристика                        КАК Характеристика,
	|	ТаблицаТовары.Серия                                 КАК Серия,
	|	1                                                   КАК КодСтроки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияЗапасов.Отгрузка) КАК ТипСборки,
	|	ТаблицаТовары.Количество                            КАК Заказано,
	|	ТаблицаТовары.Количество                            КАК КОформлению
	|ИЗ
	|	Документ.СборкаТоваров.Серии КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &СборкаПоЗаказу
	|	И ТаблицаТовары.Номенклатура   = ТаблицаТовары.Ссылка.Номенклатура
	|	И ТаблицаТовары.Характеристика = ТаблицаТовары.Ссылка.Характеристика
	|	И ТаблицаТовары.Назначение     = ТаблицаТовары.Ссылка.Назначение
	|	И ТаблицаТовары.Ссылка.СтатусУказанияСерий = 10 // статус = 10, тогда серии берутся из отдельной табличной части Серии
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Комплектующие.
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)   КАК ВидДвижения,
	|	&ДатаРаспоряжения                        КАК Период,
	|	&ЗаказНаСборку                           КАК ЗаказНаСборку,
	|	ТаблицаТовары.Номенклатура               КАК Номенклатура,
	|	ТаблицаТовары.Характеристика             КАК Характеристика,
	|	ВЫБОР КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров) ТОГДА
	|				ТаблицаТовары.Серия
	|		КОНЕЦ                                КАК Серия,
	|	ТаблицаТовары.КодСтроки                  КАК КодСтроки,
	|	ВЫБОР КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияЗапасов.Отгрузка)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияЗапасов.Поступление)
	|	КОНЕЦ                                    КАК ТипСборки,
	|	ТаблицаТовары.Количество                 КАК Заказано,
	|	ТаблицаТовары.Количество                 КАК КОформлению
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &СборкаПоЗаказу";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

	Возврат ТекстЗапроса;

КонецФункции

&ИзменениеИКонтроль("ДанныеТаблицыТоварыДокумента")
Функция смарт_ДанныеТаблицыТоварыДокумента(Накладная, ПоШапке)

	Запрос = Новый Запрос;

	Если ПоШапке Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	0 КАК НомерСтроки,
		|	ЕСТЬNULL(СборкаТоваровСерии.Количество, СборкаТоваров.Количество)         КАК Количество,
		|	ЕСТЬNULL(СборкаТоваровСерии.Номенклатура, СборкаТоваров.Номенклатура)     КАК Номенклатура,
		|	ЕСТЬNULL(СборкаТоваровСерии.Характеристика, СборкаТоваров.Характеристика) КАК Характеристика,
		|	ЕСТЬNULL(СборкаТоваровСерии.Назначение, СборкаТоваров.Назначение)         КАК Назначение,
		|	ЕСТЬNULL(СборкаТоваровСерии.Серия, СборкаТоваров.Серия)                   КАК Серия,
		|	СборкаТоваров.Упаковка                                                    КАК Упаковка,
		|	СборкаТоваровСерии.НомерСтроки                                            КАК ИдентификаторСтроки,
		|	СборкаТоваров.СтатусУказанияСерий                                         КАК СтатусУказанияСерий,
		|	СборкаТоваров.АналитикаУчетаНоменклатуры                                  КАК АналитикаУчетаНоменклатуры,
		|	ВЫБОР КОГДА СборкаТоваров.ЗаказНаСборку = ЗНАЧЕНИЕ(Документ.ЗаказНаСборку.ПустаяСсылка)
		|		ТОГДА СборкаТоваров.Ссылка
		|		ИНАЧЕ СборкаТоваров.ЗаказНаСборку
		|	КОНЕЦ                                                                     КАК ЗаказНаСборку,
		|	1                                                                         КАК КодСтроки
		|ИЗ
		|	Документ.СборкаТоваров КАК СборкаТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборкаТоваров.Серии КАК СборкаТоваровСерии
		|		ПО (СборкаТоваровСерии.Ссылка = СборкаТоваров.Ссылка)
		|ГДЕ
		|	СборкаТоваров.Ссылка = &Ссылка";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СборкаТоваровТовары.НомерСтроки                КАК НомерСтроки,
		|	СборкаТоваровТовары.Номенклатура               КАК Номенклатура,
		|	СборкаТоваровТовары.Характеристика             КАК Характеристика,
		|	СборкаТоваровТовары.Назначение                 КАК Назначение,
		|	СборкаТоваровТовары.Упаковка                   КАК Упаковка,
		|	СборкаТоваровТовары.КоличествоУпаковок         КАК КоличествоУпаковок,
		|	СборкаТоваровТовары.Количество                 КАК Количество,
		|	СборкаТоваровТовары.ДоляСтоимости              КАК ДоляСтоимости,
		|	СборкаТоваровТовары.КодСтроки                  КАК КодСтроки,
		|	СборкаТоваровТовары.СтатусУказанияСерий        КАК СтатусУказанияСерий,
		|	СборкаТоваровТовары.Серия                      КАК Серия,
		|	СборкаТоваровТовары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	СборкаТоваровТовары.ИдентификаторСтроки        КАК ИдентификаторСтроки,
		|	ВЫБОР КОГДА СборкаТоваровТовары.Ссылка.ЗаказНаСборку = ЗНАЧЕНИЕ(Документ.ЗаказНаСборку.ПустаяСсылка)
		|		ТОГДА СборкаТоваровТовары.Ссылка
		|		ИНАЧЕ СборкаТоваровТовары.Ссылка.ЗаказНаСборку
		|	КОНЕЦ                                          КАК ЗаказНаСборку
		#Вставка
		//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
		|	,СборкаТоваровТовары.смартЗапчастиГарантийные КАК смартЗапчастиГарантийные
		//-- #Б2972 смарт: Шляпников 07.11.2025
		#КонецВставки
		|ИЗ
		|	Документ.СборкаТоваров.Товары КАК СборкаТоваровТовары
		|ГДЕ
		|	СборкаТоваровТовары.Ссылка = &Ссылка";
	КонецЕсли;

	Запрос.УстановитьПараметр("Ссылка", Накладная);

	Результат = Запрос.Выполнить().Выгрузить();

	Возврат Результат;

КонецФункции

&ИзменениеИКонтроль("ТекстЗапросаТаблицаТоварыКОтгрузке")
Функция смарт_ТекстЗапросаТаблицаТоварыКОтгрузке(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "ТоварыКОтгрузке";

	Если Не ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ТекстЗапроса = " 
	// Комплектующие. Отгрузка по распоряжению с неордерного слкада (расход "К отгрузке", "К оформлению).
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период                      КАК Период,
	|	&Склад                       КАК Склад,
	|	&Склад                       КАК Получатель,
	|	&ЗаказНаСборку               КАК ДокументОтгрузки,
	|	ТаблицаТовары.Номенклатура   КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР КОГДА ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам ТОГДА
	|			ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                        КАК Назначение,
	|	ТаблицаТовары.Серия          КАК Серия,
	|	ТаблицаТовары.Количество     КАК КОтгрузке,
	|	ТаблицаТовары.Количество     КАК КОформлению
	#Вставка
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	|	,0     КАК смартКОтгрузкеГарантийные,
	|	0     КАК смартКОформлениюГарантийные
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|	И НЕ &ОрдернаяСхемаПриОтгрузке
	|	И &СборкаПоЗаказу
	#Вставка
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	|	И НЕ ТаблицаТовары.смартЗапчастиГарантийные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период                      КАК Период,
	|	&Склад                       КАК Склад,
	|	&Склад                       КАК Получатель,
	|	&ЗаказНаСборку               КАК ДокументОтгрузки,
	|	ТаблицаТовары.Номенклатура   КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР КОГДА ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам ТОГДА
	|			ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                        КАК Назначение,
	|	ТаблицаТовары.Серия          КАК Серия,
	|	0     КАК КОтгрузке,
	|	0     КАК КОформлению,
	|	ТаблицаТовары.Количество     КАК смартКОтгрузкеГарантийные,
	|	ТаблицаТовары.Количество     КАК смартКОформлениюГарантийные
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|	И НЕ &ОрдернаяСхемаПриОтгрузке
	|	И &СборкаПоЗаказу
	|	И ТаблицаТовары.смартЗапчастиГарантийные
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Комплектующие. Оформление накладной по распоряжению с ордерного слкада (расход "К оформлению").
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период                      КАК Период,
	|	&Склад                       КАК Склад,
	|	&Склад                       КАК Получатель,
	|	&ЗаказНаСборку               КАК ДокументОтгрузки,
	|	ТаблицаТовары.Номенклатура   КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР КОГДА ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам ТОГДА
	|			ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                        КАК Назначение,
	|	ТаблицаТовары.Серия          КАК Серия,
	|	0                            КАК КОтгрузке,
	|	ТаблицаТовары.Количество     КАК КОформлению
	#Вставка
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	|	,0     КАК смартКОтгрузкеГарантийные,
	|	0     КАК смартКОформлениюГарантийные
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|	И &ОрдернаяСхемаПриОтгрузке
	|	И &СборкаПоЗаказу
	#Вставка
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	|	И НЕ ТаблицаТовары.смартЗапчастиГарантийные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период                      КАК Период,
	|	&Склад                       КАК Склад,
	|	&Склад                       КАК Получатель,
	|	&ЗаказНаСборку               КАК ДокументОтгрузки,
	|	ТаблицаТовары.Номенклатура   КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР КОГДА ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам ТОГДА
	|			ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                        КАК Назначение,
	|	ТаблицаТовары.Серия          КАК Серия,
	|	0                            КАК КОтгрузке,
	|	0     КАК КОформлению,
	|	0     КАК смартКОтгрузкеГарантийные,
	|	ТаблицаТовары.Количество     КАК смартКОформлениюГарантийные
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|	И &ОрдернаяСхемаПриОтгрузке
	|	И &СборкаПоЗаказу
	|	И ТаблицаТовары.смартЗапчастиГарантийные
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Комплектующие. Выдача распоряжения на отгрузку с ордерного слкада (приход "К отгрузке", "К оформлению").
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период                         КАК Период,
	|	&Склад                          КАК Склад,
	|	&Склад                          КАК Получатель,
	|	&Ссылка                         КАК ДокументОтгрузки,
	|	ТаблицаТовары.Номенклатура      КАК Номенклатура,
	|	ТаблицаТовары.Характеристика    КАК Характеристика,
	|	ВЫБОР КОГДА ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам ТОГДА
	|			ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                           КАК Назначение,
	|	ТаблицаТовары.Серия             КАК Серия,
	|	ТаблицаТовары.Количество        КАК КОтгрузке,
	|	0                               КАК КОформлению
	#Вставка
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	|	,0     КАК смартКОтгрузкеГарантийные,
	|	0     КАК смартКОформлениюГарантийные
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|	И &ОрдернаяСхемаПриОтгрузке
	|	И НЕ &СборкаПоЗаказу
	#Вставка
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	|	И НЕ ТаблицаТовары.смартЗапчастиГарантийные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период                         КАК Период,
	|	&Склад                          КАК Склад,
	|	&Склад                          КАК Получатель,
	|	&Ссылка                         КАК ДокументОтгрузки,
	|	ТаблицаТовары.Номенклатура      КАК Номенклатура,
	|	ТаблицаТовары.Характеристика    КАК Характеристика,
	|	ВЫБОР КОГДА ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам ТОГДА
	|			ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                           КАК Назначение,
	|	ТаблицаТовары.Серия             КАК Серия,
	|	0        КАК КОтгрузке,
	|	0                               КАК КОформлению,
	|	ТаблицаТовары.Количество     КАК смартКОтгрузкеГарантийные,
	|	0     КАК смартКОформлениюГарантийные
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|	И &ОрдернаяСхемаПриОтгрузке
	|	И НЕ &СборкаПоЗаказу
	|	И ТаблицаТовары.смартЗапчастиГарантийные
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Комплектующие. Приход-расход для накладных не по заказу на неордерном складе (приход и расход "К отгрузке").
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период                      КАК Период,
	|	&Склад                       КАК Склад,
	|	&Склад                       КАК Получатель,
	|	&Ссылка                      КАК ДокументОтгрузки,
	|	ТаблицаТовары.Номенклатура   КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР КОГДА ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам ТОГДА
	|			ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                        КАК Назначение,
	|	ТаблицаТовары.Серия          КАК Серия,
	|	ТаблицаТовары.Количество     КАК КОтгрузке,
	|	0                            КАК КОформлению
	#Вставка
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	|	,0     КАК смартКОтгрузкеГарантийные,
	|	0     КАК смартКОформлениюГарантийные
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|	И НЕ &ОрдернаяСхемаПриОтгрузке
	|	И НЕ &СборкаПоЗаказу
	#Вставка
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	|	И НЕ ТаблицаТовары.смартЗапчастиГарантийные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период                      КАК Период,
	|	&Склад                       КАК Склад,
	|	&Склад                       КАК Получатель,
	|	&Ссылка                      КАК ДокументОтгрузки,
	|	ТаблицаТовары.Номенклатура   КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР КОГДА ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам ТОГДА
	|			ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                        КАК Назначение,
	|	ТаблицаТовары.Серия          КАК Серия,
	|	0     КАК КОтгрузке,
	|	0                            КАК КОформлению,
	|	ТаблицаТовары.Количество     КАК смартКОтгрузкеГарантийные,
	|	0     КАК смартКОформлениюГарантийные
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|	И НЕ &ОрдернаяСхемаПриОтгрузке
	|	И НЕ &СборкаПоЗаказу
	|	И ТаблицаТовары.смартЗапчастиГарантийные
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период                      КАК Период,
	|	&Склад                       КАК Склад,
	|	&Склад                       КАК Получатель,
	|	&Ссылка                      КАК ДокументОтгрузки,
	|	ТаблицаТовары.Номенклатура   КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР КОГДА ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам ТОГДА
	|			ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                        КАК Назначение,
	|	ТаблицаТовары.Серия          КАК Серия,
	|	ТаблицаТовары.Количество     КАК КОтгрузке,
	|	0                            КАК КОформлению
	#Вставка
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	|	,0     КАК смартКОтгрузкеГарантийные,
	|	0     КАК смартКОформлениюГарантийные
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|	И НЕ &ОрдернаяСхемаПриОтгрузке
	|	И НЕ &СборкаПоЗаказу
	#Вставка
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	|	И НЕ ТаблицаТовары.смартЗапчастиГарантийные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период                      КАК Период,
	|	&Склад                       КАК Склад,
	|	&Склад                       КАК Получатель,
	|	&Ссылка                      КАК ДокументОтгрузки,
	|	ТаблицаТовары.Номенклатура   КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР КОГДА ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам ТОГДА
	|			ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                        КАК Назначение,
	|	ТаблицаТовары.Серия          КАК Серия,
	|	0     КАК КОтгрузке,
	|	0                            КАК КОформлению,
	|	ТаблицаТовары.Количество     КАК смартКОтгрузкеГарантийные,
	|	0     КАК смартКОформлениюГарантийные
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|	И НЕ &ОрдернаяСхемаПриОтгрузке
	|	И НЕ &СборкаПоЗаказу
	|	И ТаблицаТовары.смартЗапчастиГарантийные
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Комплекты. Отгрузка по распоряжению с неордерного слкада (расход "К отгрузке").
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период                      КАК Период,
	|	&Склад                       КАК Склад,
	|	&Склад                       КАК Получатель,
	|	&ЗаказНаСборку               КАК ДокументОтгрузки,
	|	ТаблицаТовары.Номенклатура   КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                        КАК Назначение,
	|	ТаблицаТовары.Серия          КАК Серия,
	|	ТаблицаТовары.Количество     КАК КОтгрузке,
	|	ТаблицаТовары.Количество     КАК КОформлению
	#Вставка
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	|	,0     КАК смартКОтгрузкеГарантийные,
	|	0     КАК смартКОформлениюГарантийные
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	|ИЗ
	|	Документ.СборкаТоваров КАК ТаблицаТовары
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|	И ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.СтатусУказанияСерий <> 10
	|	И НЕ &ОрдернаяСхемаПриОтгрузке
	|	И &СборкаПоЗаказу
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период                        КАК Период,
	|	&Склад                         КАК Склад,
	|	&Склад                         КАК Получатель,
	|	&ЗаказНаСборку                 КАК ДокументОтгрузки,
	|	ДанныеДокумента.Номенклатура   КАК Номенклатура,
	|	ДанныеДокумента.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДанныеДокумента.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ДанныеДокумента.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                          КАК Назначение,
	|	ТаблицаТовары.Серия            КАК Серия,
	|	ДанныеДокумента.Количество     КАК КОтгрузке,
	|	ДанныеДокумента.Количество     КАК КОформлению
	#Вставка
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	|	,0     КАК смартКОтгрузкеГарантийные,
	|	0     КАК смартКОформлениюГарантийные
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	|ИЗ
	|	Документ.СборкаТоваров КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СборкаТоваров.Серии КАК ТаблицаТовары
	|		ПО ДанныеДокумента.Ссылка = ТаблицаТовары.Ссылка
	|			И ДанныеДокумента.Номенклатура = ТаблицаТовары.Номенклатура
	|			И ДанныеДокумента.Характеристика = ТаблицаТовары.Характеристика
	|			И ДанныеДокумента.Назначение = ТаблицаТовары.Назначение
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|	И ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.СтатусУказанияСерий = 10
	|	И НЕ &ОрдернаяСхемаПриОтгрузке
	|	И &СборкаПоЗаказу
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Комплекты. Приход-расход для накладных не по заказу на неордерном складе (приход и расход "К отгрузке").
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период                      КАК Период,
	|	&Склад                       КАК Склад,
	|	&Склад                       КАК Получатель,
	|	&Ссылка                      КАК ДокументОтгрузки,
	|	ТаблицаТовары.Номенклатура   КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                        КАК Назначение,
	|	ТаблицаТовары.Серия          КАК Серия,
	|	ТаблицаТовары.Количество     КАК КОтгрузке,
	|	0                            КАК КОформлению
	#Вставка
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	|	,0     КАК смартКОтгрузкеГарантийные,
	|	0     КАК смартКОформлениюГарантийные
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	|ИЗ
	|	Документ.СборкаТоваров КАК ТаблицаТовары
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|	И ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.СтатусУказанияСерий <> 10
	|	И НЕ &ОрдернаяСхемаПриОтгрузке
	|	И НЕ &СборкаПоЗаказу
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период                        КАК Период,
	|	&Склад                         КАК Склад,
	|	&Склад                         КАК Получатель,
	|	&Ссылка                        КАК ДокументОтгрузки,
	|	ДанныеДокумента.Номенклатура   КАК Номенклатура,
	|	ДанныеДокумента.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДанныеДокумента.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ДанныеДокумента.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                          КАК Назначение,
	|	ТаблицаТовары.Серия            КАК Серия,
	|	ДанныеДокумента.Количество     КАК КОтгрузке,
	|	0                              КАК КОформлению
	#Вставка
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	|	,0     КАК смартКОтгрузкеГарантийные,
	|	0     КАК смартКОформлениюГарантийные
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	|ИЗ
	|	Документ.СборкаТоваров КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СборкаТоваров.Серии КАК ТаблицаТовары
	|		ПО ДанныеДокумента.Ссылка = ТаблицаТовары.Ссылка
	|			И ДанныеДокумента.Номенклатура = ТаблицаТовары.Номенклатура
	|			И ДанныеДокумента.Характеристика = ТаблицаТовары.Характеристика
	|			И ДанныеДокумента.Назначение = ТаблицаТовары.Назначение
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|	И ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.СтатусУказанияСерий = 10
	|	И НЕ &ОрдернаяСхемаПриОтгрузке
	|	И НЕ &СборкаПоЗаказу
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период                      КАК Период,
	|	&Склад                       КАК Склад,
	|	&Склад                       КАК Получатель,
	|	&Ссылка                      КАК ДокументОтгрузки,
	|	ТаблицаТовары.Номенклатура   КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                        КАК Назначение,
	|	ТаблицаТовары.Серия          КАК Серия,
	|	ТаблицаТовары.Количество     КАК КОтгрузке,
	|	0                            КАК КОформлению
	#Вставка
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	|	,0     КАК смартКОтгрузкеГарантийные,
	|	0     КАК смартКОформлениюГарантийные
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	|ИЗ
	|	Документ.СборкаТоваров КАК ТаблицаТовары
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|	И ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.СтатусУказанияСерий <> 10
	|	И НЕ &ОрдернаяСхемаПриОтгрузке
	|	И НЕ &СборкаПоЗаказу
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период                        КАК Период,
	|	&Склад                         КАК Склад,
	|	&Склад                         КАК Получатель,
	|	&Ссылка                        КАК ДокументОтгрузки,
	|	ДанныеДокумента.Номенклатура   КАК Номенклатура,
	|	ДанныеДокумента.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДанныеДокумента.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ДанныеДокумента.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                          КАК Назначение,
	|	ТаблицаТовары.Серия            КАК Серия,
	|	ДанныеДокумента.Количество     КАК КОтгрузке,
	|	0                              КАК КОформлению
	#Вставка
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	|	,0     КАК смартКОтгрузкеГарантийные,
	|	0     КАК смартКОформлениюГарантийные
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	|ИЗ
	|	Документ.СборкаТоваров КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СборкаТоваров.Серии КАК ТаблицаТовары
	|		ПО ДанныеДокумента.Ссылка = ТаблицаТовары.Ссылка
	|			И ДанныеДокумента.Номенклатура = ТаблицаТовары.Номенклатура
	|			И ДанныеДокумента.Характеристика = ТаблицаТовары.Характеристика
	|			И ДанныеДокумента.Назначение = ТаблицаТовары.Назначение
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|	И ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.СтатусУказанияСерий = 10
	|	И НЕ &ОрдернаяСхемаПриОтгрузке
	|	И НЕ &СборкаПоЗаказу
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Оформление накладной по распоряжению с ордерного слкада (расход "К оформлению").
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период                      КАК Период,
	|	&Склад                       КАК Склад,
	|	&Склад                       КАК Получатель,
	|	&ЗаказНаСборку               КАК ДокументОтгрузки,
	|	ТаблицаТовары.Номенклатура   КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                        КАК Назначение,
	|	ТаблицаТовары.Серия          КАК Серия,
	|	0                            КАК КОтгрузке,
	|	ТаблицаТовары.Количество     КАК КОформлению
	#Вставка
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	|	,0     КАК смартКОтгрузкеГарантийные,
	|	0     КАК смартКОформлениюГарантийные
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	|ИЗ
	|	Документ.СборкаТоваров КАК ТаблицаТовары
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|	И ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.СтатусУказанияСерий <> 10
	|	И &ОрдернаяСхемаПриОтгрузке
	|	И &СборкаПоЗаказу
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Оформление накладной по распоряжению с ордерного слкада (расход "К оформлению").
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период                        КАК Период,
	|	&Склад                         КАК Склад,
	|	&Склад                         КАК Получатель,
	|	&ЗаказНаСборку                 КАК ДокументОтгрузки,
	|	ДанныеДокумента.Номенклатура   КАК Номенклатура,
	|	ДанныеДокумента.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДанныеДокумента.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ДанныеДокумента.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                          КАК Назначение,
	|	ТаблицаТовары.Серия            КАК Серия,
	|	0                              КАК КОтгрузке,
	|	ДанныеДокумента.Количество     КАК КОформлению
	#Вставка
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	|	,0     КАК смартКОтгрузкеГарантийные,
	|	0     КАК смартКОформлениюГарантийные
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	|ИЗ
	|	Документ.СборкаТоваров КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СборкаТоваров.Серии КАК ТаблицаТовары
	|		ПО ДанныеДокумента.Ссылка = ТаблицаТовары.Ссылка
	|			И ДанныеДокумента.Номенклатура = ТаблицаТовары.Номенклатура
	|			И ДанныеДокумента.Характеристика = ТаблицаТовары.Характеристика
	|			И ДанныеДокумента.Назначение = ТаблицаТовары.Назначение
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|	И ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.СтатусУказанияСерий = 10
	|	И &ОрдернаяСхемаПриОтгрузке
	|	И &СборкаПоЗаказу
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Выдача распоряжения на отгрузку с ордерного слкада (приход "К отгрузке").
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период                      КАК Период,
	|	&Склад                       КАК Склад,
	|	&Склад                       КАК Получатель,
	|	&Ссылка                      КАК ДокументОтгрузки,
	|	ТаблицаТовары.Номенклатура   КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                        КАК Назначение,
	|	ТаблицаТовары.Серия          КАК Серия,
	|	ТаблицаТовары.Количество     КАК КОтгрузке,
	|	0                            КАК КОформлению
	#Вставка
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	|	,0     КАК смартКОтгрузкеГарантийные,
	|	0     КАК смартКОформлениюГарантийные
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	|ИЗ
	|	Документ.СборкаТоваров КАК ТаблицаТовары
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|	И ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.СтатусУказанияСерий <> 10
	|	И &ОрдернаяСхемаПриОтгрузке
	|	И НЕ &СборкаПоЗаказу
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период                        КАК Период,
	|	&Склад                         КАК Склад,
	|	&Склад                         КАК Получатель,
	|	&Ссылка                        КАК ДокументОтгрузки,
	|	ДанныеДокумента.Номенклатура   КАК Номенклатура,
	|	ДанныеДокумента.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДанныеДокумента.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ДанныеДокумента.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ                          КАК Назначение,
	|	ТаблицаТовары.Серия            КАК Серия,
	|	ДанныеДокумента.Количество     КАК КОтгрузке,
	|	0                              КАК КОформлению
	#Вставка
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	|	,0     КАК смартКОтгрузкеГарантийные,
	|	0     КАК смартКОформлениюГарантийные
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	|ИЗ
	|	Документ.СборкаТоваров КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СборкаТоваров.Серии КАК ТаблицаТовары
	|		ПО ДанныеДокумента.Ссылка = ТаблицаТовары.Ссылка
	|			И ДанныеДокумента.Номенклатура = ТаблицаТовары.Номенклатура
	|			И ДанныеДокумента.Характеристика = ТаблицаТовары.Характеристика
	|			И ДанныеДокумента.Назначение = ТаблицаТовары.Назначение
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|	И ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.СтатусУказанияСерий = 10
	|	И &ОрдернаяСхемаПриОтгрузке
	|	И НЕ &СборкаПоЗаказу";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра); 

	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#Область ДоработкиСмарт

//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
Функция смартТекстЗапросаТаблицаЗаявкиНаРазборкуОборудования(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "смартЗаявкиНаРазборкуОборудования";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&ЗаявкаНаРазборкуОборудования КАК Заявка,
	|	&Номенклатура КАК Номенклатура,
	|	&Серия КАК Серия,
	|	1 КАК КРазборке,
	|	0 КАК КПолучению
	|
	|ГДЕ 
	|	&ЭтоРазборкаОборудования
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)		
	|	
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период 						КАК Период,
	|	&ЗаявкаНаРазборкуОборудования	КАК Заявка,
	|	ДокументТовары.Номенклатура 	КАК Номенклатура,
	|	&Серия 							КАК Серия, 
	|	0 								КАК КРазборке,
	|	ДокументТовары.Количество 		КАК КПолучению
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК ДокументТовары
	|ГДЕ
	|	&ЭтоРазборкаОборудования
	|	И ДокументТовары.Ссылка = &Ссылка
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
Функция смартТекстЗапросаТаблицаОборудованиеКРазборке(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "смартОборудованиеКРазборке";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	//++ #Б2138 смарт: Шляпников 19.02.2025 / Заявка на разборку оборудования. Обратная сборка оборудования.
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период 						КАК Период,
	|	&ЗаявкаНаРазборкуОборудования 	КАК Заявка,
	|	&Номенклатура 					КАК Номенклатура,
	|	&Серия 							КАК Серия,
	|	&Склад	 						КАК Склад,
	|	&ПустойСклад	 				КАК СкладПолучатель,
	|	&НазначениеЗаявкаНаРазборку		КАК Назначение,
	|	1 								КАК КРазборке,
	|	1 								КАК КРазборкеЗаказано,	
	|	0 								КАК КПолучению,
	|	0 								КАК КПолучениюЗаказано,
	|	0 								КАК КЗаказуПоставщику,
	|	0 								КАК КЗаказуПоставщикуЗаказано,
	|	0 								КАК КСборке,
	|	0 								КАК КСборкеЗаказано,
	|	0 								КАК КПолучениюОборудование,
	|	0 								КАК КПолучениюОборудованиеЗаказано
	|ГДЕ
	|	&ЭтоРазборкаОборудования
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)	
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период 						КАК Период,
	|	&ЗаявкаНаРазборкуОборудования 	КАК Заявка,
	|	ДокументТовары.Номенклатура 	КАК Номенклатура,
	|	&Серия 							КАК Серия,
	|	&Склад	 						КАК Склад,
	|	&ПустойСклад	 				КАК СкладПолучатель,
	|	&НазначениеЗаявкаНаРазборку		КАК Назначение,
	|	0 								КАК КРазборке,
	|	0 								КАК КРазборкеЗаказано,	
	|	ДокументТовары.Количество		КАК КПолучению,
	|	ДокументТовары.Количество		КАК КПолучениюЗаказано	,
	|	0 								КАК КЗаказуПоставщику,
	|	0 								КАК КЗаказуПоставщикуЗаказано,
	|	0 								КАК КСборке,
	|	0 								КАК КСборкеЗаказано,
	|	0 								КАК КПолучениюОборудование,
	|	0 								КАК КПолучениюОборудованиеЗаказано
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК ДокументТовары
	|ГДЕ                                
	|	&ЭтоРазборкаОборудования	
	|	И ДокументТовары.Ссылка = &Ссылка
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период 						КАК Период,
	|	&ЗаявкаНаРазборкуОборудования 	КАК Заявка,
	|	&Номенклатура 					КАК Номенклатура,
	|	&Серия 							КАК Серия,
	|	&Склад	 						КАК Склад,
	|	&ПустойСклад	 				КАК СкладПолучатель,
	|	&НазначениеЗаявкаНаРазборку		КАК Назначение,
	|	0 								КАК КРазборке,
	|	0 								КАК КРазборкеЗаказано,	
	|	0 								КАК КПолучению,
	|	0 								КАК КПолучениюЗаказано,
	|	0 								КАК КЗаказуПоставщику,
	|	0 								КАК КЗаказуПоставщикуЗаказано,
	|	0 								КАК КСборке,
	|	0 								КАК КСборкеЗаказано,
	|	1 								КАК КПолучениюОборудование,
	|	0 								КАК КПолучениюОборудованиеЗаказано
	|ГДЕ
	|	&ЭтоРазборкаОборудования
	|	И НЕ &СборкаНеТребуется
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)	
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период 						КАК Период,
	|	&ЗаявкаНаРазборкуОборудования 	КАК Заявка,
	|	ДокументТовары.Номенклатура 	КАК Номенклатура,
	|	&Серия 							КАК Серия,
	|	&Склад	 						КАК Склад,
	|	&ПустойСклад	 				КАК СкладПолучатель,
	|	&НазначениеЗаявкаНаРазборку		КАК Назначение,
	|	0 								КАК КРазборке,
	|	0 								КАК КРазборкеЗаказано,	
	|	0								КАК КПолучению,
	|	0								КАК КПолучениюЗаказано,
	|	ДокументТовары.Количество		КАК КЗаказуПоставщику,
	|	0 								КАК КЗаказуПоставщикуЗаказано,
	|	0								КАК КСборке,
	|	0 								КАК КСборкеЗаказано,
	|	0 								КАК КПолучениюОборудование,
	|	0 								КАК КПолучениюОборудованиеЗаказано
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК ДокументТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаРазборкуОборудования.Комплектующие КАК ТоварыЗаявки
	|		ПО ДокументТовары.Номенклатура = ТоварыЗаявки.Номенклатура
	|		И ТоварыЗаявки.Ссылка = &ЗаявкаНаРазборкуОборудования
	|		И НЕ ТоварыЗаявки.НеЗаказывать
	|ГДЕ                                
	|	&ЭтоРазборкаОборудования	
	|	И НЕ &СборкаНеТребуется
	|	И НЕ ДокументТовары.Номенклатура = &Узел
	|	И ДокументТовары.Ссылка = &Ссылка
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период 						КАК Период,
	|	&ЗаявкаНаРазборкуОборудования 	КАК Заявка,
	|	ДокументТовары.Номенклатура 	КАК Номенклатура,
	|	&Серия 							КАК Серия,
	|	&Склад	 						КАК Склад,
	|	&ПустойСклад	 				КАК СкладПолучатель,
	|	&НазначениеЗаявкаНаРазборку		КАК Назначение,
	|	0 								КАК КРазборке,
	|	0 								КАК КРазборкеЗаказано,	
	|	0								КАК КПолучению,
	|	0								КАК КПолучениюЗаказано,
	|	0								КАК КЗаказуПоставщику,
	|	0 								КАК КЗаказуПоставщикуЗаказано,
	|	ДокументТовары.Количество		КАК КСборке,
	|	0 								КАК КСборкеЗаказано,
	|	0 								КАК КПолучениюОборудование,
	|	0 								КАК КПолучениюОборудованиеЗаказано
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК ДокументТовары
	|ГДЕ                                
	|	&ЭтоРазборкаОборудования	
	|	И НЕ &СборкаНеТребуется
	|	И ДокументТовары.Ссылка = &Ссылка
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|
	//ОБРАТНАЯ СБОРКА
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период 						КАК Период,
	|	&ЗаявкаНаРазборкуОборудования 	КАК Заявка,
	|	&Номенклатура 					КАК Номенклатура,
	|	&Серия 							КАК Серия,
	|	&Склад	 						КАК Склад,
	|	&ПустойСклад	 				КАК СкладПолучатель,
	|	&НазначениеЗаявкаНаРазборку		КАК Назначение,
	|	0 								КАК КРазборке,
	|	0 								КАК КРазборкеЗаказано,	
	|	0 								КАК КПолучению,
	|	0 								КАК КПолучениюЗаказано,
	|	0 								КАК КЗаказуПоставщику,
	|	0 								КАК КЗаказуПоставщикуЗаказано,
	|	0 								КАК КСборке,
	|	0 								КАК КСборкеЗаказано,
	|	1 								КАК КПолучениюОборудование,
	|	1 								КАК КПолучениюОборудованиеЗаказано
	|ГДЕ
	|	&ЭтоРазборкаОборудования
	|	И НЕ &СборкаНеТребуется
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период 						КАК Период,
	|	&ЗаявкаНаРазборкуОборудования 	КАК Заявка,
	|	ДокументТовары.Номенклатура 	КАК Номенклатура,
	|	&Серия 							КАК Серия,
	|	&Склад	 						КАК Склад,
	|	&ПустойСклад	 				КАК СкладПолучатель,
	|	&НазначениеЗаявкаНаРазборку		КАК Назначение,
	|	0 								КАК КРазборке,
	|	0 								КАК КРазборкеЗаказано,	
	|	0								КАК КПолучению,
	|	0								КАК КПолучениюЗаказано,
	|	0								КАК КЗаказуПоставщику,
	|	0 								КАК КЗаказуПоставщикуЗаказано,
	|	ДокументТовары.Количество		КАК КСборке,
	|	ДокументТовары.Количество		КАК КСборкеЗаказано,
	|	0 								КАК КПолучениюОборудование,
	|	0 								КАК КПолучениюОборудованиеЗаказано
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК ДокументТовары
	|ГДЕ                                
	|	&ЭтоРазборкаОборудования	
	|	И НЕ &СборкаНеТребуется
	|	И ДокументТовары.Ссылка = &Ссылка
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)";
	//-- #Б2138 смарт: Шляпников 19.02.2025

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#КонецЕсли
